In [27]:
import os
import pandas as pd

In [9]:
data1 = pd.DataFrame([[2,5,6],[3,54,33]],columns=(["numOfBoys","Size","value"]))

In [10]:
data1

   numOfBoys  Size  value
0          2     5      6
1          3    54     33

In [11]:
data2 = pd.DataFrame([{"Name":"Bernard","Nickname":"Chingy"},{"Name":"Josh"}])

In [12]:
data2

      Name Nickname
0  Bernard   Chingy
1     Josh      NaN

In [22]:
data1.mean().mean(),data1.Size.max(),data1.value.mean()

(17.166666666666668, 54, 19.5)

In [30]:
os.listdir()

['.idea',
 '.ipynb_checkpoints',
 'Learner.py',
 'LearnJupiter.ipynb',
 'supermarkets.csv',
 'supermarkets.json',
 'supermarkets_c.txt',
 'supermarkets_sc.txt']

In [88]:
data3 = pd.read_csv("supermarkets.csv")
data3 = data3.set_index("ID")
data3

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [35]:
#fn is filepath eg.. c:/pyjunc/supermarkets.json or online link[http]
#pd.[read_json(fn), read_excel(fn,sheetname=0[sheetindex])]
#csv = character_seperated_values
#pd.read_csv(fn, sep=";"[sep = seperator character])
#for help use pd.function_name?

In [90]:
#indexing data in the data frame
#data.loc['row','column'], data.loc['row_begin':'row_end','column_begin':'column_end'] //indexing using labels
#data.iloc[1,2],data.iloc[:,1:3]
#data.ix[1,'column_name'],data.ix[1:2,'column_begin','column_end']   Deprecated ....
#for columns use data3.columns[:], indexs use data3.index[:]
data3.loc[2:,'Address']

ID
2      735 Dolores St
3         332 Hill St
4        3995 23rd St
5     1056 Sanchez St
6     551 Alvarado St
Name: Address, dtype: object

In [92]:
#data3.columns[:],data3.index[:]